create table book (
	`id` UInt32,
	`a_id` UInt32,
	`name` String,
	`price` UInt32,
	`sign` UInt32
) ENGINE = CollapsingMergeTree() order by id


INSERT INTO book (`id`, `a_id`,`name`,`price`, `sign`) VALUES
	 (1,5,'Taras Bulba',500,1),
	 (2,5,'Vechera Na Hutore',700,1),
	 (3, 5,'Dead Souls',900,1),
	 (4, 5,'Nevski Prospekt',1100,1),
	 (5, 4,'Мы',900,1),
	 (6, 4,'Бич божий',1100,1),
	 (7, 4,'Пещера',500,1),
	 (8, 4,'Островетяне',700,1),
	 (9, 3,'Униженные и оскорбленные',900,1),
	 (10, 3,'Преступление и наказание',1100,1),
	 (11, 3,'Братья карамазовы',500,1),
	 (12, 3,'Подросток',700,1),
	 (13, 3,'Идиот',1300,1),
	 (14, 2,'Хаджи Мурат',1100,1),
	 (15, 2,'Анна каренина',500,1),
	 (16, 2,'Юность',700,1),
	 (17, 2,'Детсво',1300,1),
	 (18, 1,'Мастер и маргарита',900,1),
	 (19, 1,'Де Мольер',1100,1),
	 (20, 1,'Собачье сердце',500,1),
	 (21, 1,'Белая гвардия',700,1),
	 (22, 1,'Роковые яйца',1300,1),
	 (23, 2,'Война и мир',900,1);


INSERT INTO book (`id`, `a_id`,`name`,`price`, sign) VALUES
	 (2,5,'Vechera Na Hutore',7000,-1),
	 (3, 5,'Dead Souls',9000,-1),
	 (4, 5,'Nevski Prospekt',11000,-1),
	 (5, 4,'Мы',9000,-1),
	 (6, 4,'Бич божий',11000,-1),
	 (7, 4,'Пещера',5000,-1),
	 (8, 4,'Островетяне',7000,-1),
	 (9, 3,'Униженные и оскорбленные',9000,-1),
	 (10, 3,'Преступление и наказание',11000,-1),
	 (11, 3,'Братья карамазовы',5000,-1),
	 (12, 3,'Подросток',7000,-1),
	 (13, 3,'Идиот',13000,-1),
	 (14, 2,'Хаджи Мурат',11000,-1),
	 (15, 2,'Анна каренина',5000,-1),
	 (16, 2,'Юность',7000,-1),
	 (17, 2,'Детсво',13000,-1),
	 (18, 1,'Мастер и маргарита',9000,-1),
	 (19, 1,'Де Мольер',10100,-1),
	 (20, 1,'Собачье сердце',5000,-1),
	 (21, 1,'Белая гвардия',7000,-1),
	 (22, 1,'Роковые яйца',13000,-1),
	 (23, 2,'Война и мир',9000,-1);

create table author (
	`id` UInt32,
	`name` String,
	`year` UInt32
) ENGINE = ReplacingMergeTree() order by name

 INSERT INTO author (id, name, year) VALUES
 	 (1,'Bulgakov',1891),
 	 (2,'Tolstoy',1828),
 	 (3,'Dostoevsky',1821),
 	 (4,'Zamyatin',1884),
 	 (5, 'Gogol',1809);